Autodesk.Revit.DB.Structure.RebarConstraintsManager.ApplyRebarConstraints(System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.RebarConstraint},System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Returns true if constraints were applied to rebar with success.
Remarks:
ShapeDriven : The input constraints belong to other rebar in a (different) similar host. Only constraints of type ToHostFace or ToCover are considered.
The method modifies the constraints' target references with their correspondants in current host(s).
The modified constraints are set in current rebar.
The method will fail : if there exists at least one ToOtherRebar constraint; if corresponding target references in current host(s) are not supplied or found.
FreeForm : The constraints will not be applied and the method will return false.
The two arrays go hand in hand : they must have the same size; the correspondant of oldReference at index x is found in the other array at the same index x.
constraintsToApply:
Represent the new constraints to be applied to rebar.
oldTargets:
Represent the old target references.
newTargets:
Represent the new target references.
Returns:
Returns true if the constraints were applied succesfully, false otherwise
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2019

Autodesk.Revit.DB.Structure.RebarConstraintsManager.GetConstraintCandidatesForHandle(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,Autodesk.Revit.DB.Reference)
For shape driven rebar returns all possible RebarConstraints that will constrain RebarConstrainedHandle to the provided reference.
For free form rebar will return an empty lists.
Remarks:
Will throw exception if the provided reference cannot be used to constrain the provided rebar handle.
handle:
The RebarConstrainedHandle for which constraint candidates are sought.
reference:
The reference you want to constrain to.
Returns:
A collection of RebarConstraints
Throws Autodesk.Revit.Exceptions.ArgumentException:
reference is not from a valid RebarConstraint target element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraintsManager.GetConstraintCandidatesForHandle(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,Autodesk.Revit.DB.ElementId)
For shape driven rebar returns all possible RebarConstraints belonging to references from the provided element that could be used for a specified RebarConstrainedHandle.
For free form rebar will return an empty list.
Remarks:
Will throw exception if the provided elementId is not a valid constraint target.
handle:
The RebarConstrainedHandle for which constraint candidates are sought.
elementId:
The elementId ( host or rebar ) of the element in which the candidates are searched for.
Returns:
A collection of RebarConstraints
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementId is not a valid RebarConstraint target element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2020.1